CSI API ETABS v1
cAnalyze.GetRunCaseFlag Method
 Retrieves the run flags for all analysis cases.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetRunCaseFlag(
	ref int NumberItems,
	ref string[] CaseName,
	ref bool[] Run
)
Function GetRunCaseFlag (
	ByRef NumberItems As Integer,
	ByRef CaseName As String(),
	ByRef Run As Boolean()
) As Integer
Dim instance As cAnalyze
Dim NumberItems As Integer
Dim CaseName As String()
Dim Run As Boolean()
Dim returnValue As Integer
returnValue = instance.GetRunCaseFlag(NumberItems,
	CaseName, Run)
int GetRunCaseFlag(
	int% NumberItems,
	array<String^>^% CaseName,
	array<bool>^% Run
)
abstract GetRunCaseFlag :
        NumberItems : int byref *
        CaseName : string[] byref *
        Run : bool[] byref -> int
Parameters
NumberItems
Type: System.Int32
 The number of load cases for which the run flag is reported.
CaseName
Type: System.String[]
 This is an array that includes the name of each analysis case for which the run flag is reported.
Run
Type: System.Boolean[]
 This is an array of boolean values indicating if the specified load case is to be run.
Return Value
Type: Int32
 Returns zero if the flags are successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim NumberItems As Integer
       Dim CaseName() As String
       Dim Run() As Boolean
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set load case run flag
       ret = SapModel.Analyze.SetRunCaseFlag("MODAL", False)
   'get load case run flags
       ret = SapModel.Analyze.GetRunCaseFlag(NumberItems, CaseName, Run)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalyze Interface
ETABSv1 Namespace